benchmark/io/results/IBM_x3650_M3_2xE2620_14x10k_zfs_zvol_mirror_NODIRECT.out
seq-write: (g=0): rw=write, bs=4M-4M/4M-4M/4M-4M, ioengine=libaio, iodepth=128
seq-read: (g=1): rw=read, bs=4M-4M/4M-4M/4M-4M, ioengine=libaio, iodepth=128
seq-rw: (g=2): rw=rw, bs=4M-4M/4M-4M/4M-4M, ioengine=libaio, iodepth=128
rand-write: (g=3): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
rand-read: (g=4): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
rand-rw: (g=5): rw=randrw, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
threaded-write: (g=6): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
...
threaded-read: (g=7): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
...
threaded-rw: (g=8): rw=randrw, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
...
threaded-rw-pareto: (g=9): rw=randrw, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
...
threaded-80-20: (g=10): rw=randrw, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
...
streaming-write: (g=11): rw=write, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
...
streaming-read: (g=12): rw=read, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
...
streaming-rw: (g=13): rw=rw, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
...
fio-2.16
clock setaffinity failed: Invalid argument
clock setaffinity failed: Invalid argument
clock setaffinity failed: Invalid argument
[...]
Starting 134 processes
3;fio-2.16;seq-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;81211392;270702;65;300002;1893;113745;14461.694374;9107.635424;7;2411781;1927545.809855;255849.488034;1.000000%=1187840;5.000000%=1581056;10.000000%=1777664;20.000000%=1794048;30.000000%=1794048;40.000000%=1843200;50.000000%=1892352;60.000000%=1941504;70.000000%=2039808;80.000000%=2146304;90.000000%=2277376;95.000000%=2375680;99.000000%=2408448;99.500000%=2408448;99.900000%=2408448;99.950000%=2408448;99.990000%=2408448;0%=0;0%=0;0%=0;2414;2428483;1942757.401120;257227.053862;0;0;0.000000%;0.000000;0.000000;1.894660%;19.051936%;24202;0;4;0.1%;0.1%;0.1%;0.1%;0.1%;0.2%;125.9%;0.00%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.00%;0.00%;0.01%;0.02%;0.05%;0.08%;0.09%;0.09%;66.20%;34.10%
3;fio-2.16;seq-read;1;0;77991936;259958;63;300017;10030;150891;15797.729781;4128.206474;13;2319523;2007725.496875;111914.177204;1.000000%=1859584;5.000000%=1925120;10.000000%=1941504;20.000000%=1957888;30.000000%=1990656;40.000000%=1990656;50.000000%=2007040;60.000000%=2023424;70.000000%=2039808;80.000000%=2056192;90.000000%=2088960;95.000000%=2113536;99.000000%=2179072;99.500000%=2211840;99.900000%=2310144;99.950000%=2310144;99.990000%=2310144;0%=0;0%=0;0%=0;21616;2341366;2023570.839924;112030.661155;0;0;0.000000%;0.000000;0.000000;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.127993%;70.894886%;106766;0;3;0.1%;0.1%;0.1%;0.1%;0.1%;0.2%;120.0%;0.00%;0.00%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.02%;0.04%;0.07%;0.09%;0.08%;42.44%;57.90%
3;fio-2.16;seq-rw;2;0;22167552;73710;17;300740;863;1421704;32282.831603;95471.378926;210842;39504325;3668245.065041;5699158.204730;1.000000%=216064;5.000000%=224256;10.000000%=254976;20.000000%=395264;30.000000%=946176;40.000000%=1105920;50.000000%=1712128;60.000000%=2572288;70.000000%=3227648;80.000000%=4620288;90.000000%=8290304;95.000000%=16711680;99.000000%=16711680;99.500000%=16711680;99.900000%=16711680;99.950000%=16711680;99.990000%=16711680;0%=0;0%=0;0%=0;212155;39505728;3708076.621027;5727279.671037;0;0;0.000000%;0.000000;0.000000;22675456;75398;18;300740;1682;1065921;13301.294192;72903.728257;13;39373692;3565876.445809;5627879.232370;1.000000%=216064;5.000000%=224256;10.000000%=252928;20.000000%=374784;30.000000%=929792;40.000000%=1105920;50.000000%=1613824;60.000000%=2506752;70.000000%=3162112;80.000000%=4554752;90.000000%=7634944;95.000000%=16711680;99.000000%=16711680;99.500000%=16711680;99.900000%=16711680;99.950000%=16711680;99.990000%=16711680;0%=0;0%=0;0%=0;212415;39504327;3583983.932623;5663513.073699;0;0;0.000000%;0.000000;0.000000;0.468180%;17.434387%;27743;0;5;0.1%;0.1%;0.1%;0.1%;0.1%;0.3%;145.8%;0.00%;0.00%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;9.32%;14.15%;3.02%;5.69%;21.05%;47.93%
3;fio-2.16;rand-write;3;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1586072;5286;1321;300018;1;263686;189.399959;2632.079345;7;415870;96167.930535;48331.196455;1.000000%=60160;5.000000%=60160;10.000000%=72192;20.000000%=80384;30.000000%=80384;40.000000%=83456;50.000000%=95744;60.000000%=95744;70.000000%=95744;80.000000%=95744;90.000000%=95744;95.000000%=127488;99.000000%=382976;99.500000%=399360;99.900000%=399360;99.950000%=399360;99.990000%=399360;0%=0;0%=0;0%=0;686;415876;96923.604623;48533.862005;0;0;0.000000%;0.000000;0.000000;0.211988%;0.758624%;11862;0;4;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;475.4%;0.00%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.23%;0.01%;0.00%;0.00%;0.00%;0.01%;0.10%;91.21%;5.77%;2.71%;0.00%;0.00%;0.00%;0.00%
3;fio-2.16;rand-read;4;0;430096;1433;357;300003;3;111457;2796.063400;2775.371181;7;619901;354525.996810;33727.471404;1.000000%=284672;5.000000%=301056;10.000000%=313344;20.000000%=325632;30.000000%=337920;40.000000%=346112;50.000000%=354304;60.000000%=362496;70.000000%=370688;80.000000%=382976;90.000000%=395264;95.000000%=407552;99.000000%=432128;99.500000%=448512;99.900000%=577536;99.950000%=593920;99.990000%=610304;0%=0;0%=0;0%=0;2983;622761;357314.011244;33858.654038;0;0;0.000000%;0.000000;0.000000;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.222665%;1.897321%;62799;0;3;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;119.6%;0.00%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;0.01%;0.01%;0.02%;0.08%;99.87%;0.13%;0.00%;0.00%;0.00%
3;fio-2.16;rand-rw;5;0;398508;1328;331;300003;2;277221;2978.019345;3729.840908;7;752961;191570.882582;46817.417309;1.000000%=117248;5.000000%=136192;10.000000%=146432;20.000000%=158720;30.000000%=168960;40.000000%=177152;50.000000%=183296;60.000000%=193536;70.000000%=201728;80.000000%=216064;90.000000%=242688;95.000000%=272384;99.000000%=358400;99.500000%=395264;99.900000%=501760;99.950000%=659456;99.990000%=741376;0%=0;0%=0;0%=0;4386;758783;194567.498339;47234.697166;0;0;0.000000%;0.000000;0.000000;397700;1325;331;300003;2;10062;8.314493;29.293873;4388;753962;191396.145869;46709.976430;1.000000%=117248;5.000000%=136192;10.000000%=144384;20.000000%=158720;30.000000%=166912;40.000000%=175104;50.000000%=183296;60.000000%=193536;70.000000%=201728;80.000000%=216064;90.000000%=242688;95.000000%=272384;99.000000%=358400;99.500000%=391168;99.900000%=497664;99.950000%=667648;99.990000%=741376;0%=0;0%=0;0%=0;4393;753970;191404.850490;46710.293954;0;0;0.000000%;0.000000;0.000000;0.291998%;2.046653%;58205;0;4;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;120.5%;0.00%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;0.01%;0.14%;91.52%;8.30%;0.09%;0.01%;0.00%;0.00%
3;fio-2.16;threaded-write;6;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;2593064;8637;2152;300199;2;299840;2771.051566;23234.676521;6;3060294;943222.239553;526634.321729;1.000000%=80384;5.000000%=95744;10.000000%=103936;20.000000%=160768;30.000000%=1019904;40.000000%=1019904;50.000000%=1220608;60.000000%=1220608;70.000000%=1220608;80.000000%=1220608;90.000000%=1433600;95.000000%=1433600;99.000000%=2244608;99.500000%=2441216;99.900000%=2637824;99.950000%=2670592;99.990000%=2867200;0%=0;0%=0;0%=0;36406;3060300;950663.384068;530163.012175;0;0;0.000000%;0.000000;0.000000;0.009663%;0.109953%;26647;0;68;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;321.4%;0.00%;0.00%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.76%;9.10%;14.45%;2.48%;0.58%;2.24%;69.14%;1.57%
3;fio-2.16;threaded-read;7;0;4825796;16085;4014;300014;2;133467;3975.401964;4247.615546;6;723007;505731.228388;49496.329035;1.000000%=395264;5.000000%=428032;10.000000%=444416;20.000000%=464896;30.000000%=481280;40.000000%=493568;50.000000%=505856;60.000000%=518144;70.000000%=528384;80.000000%=544768;90.000000%=569344;95.000000%=585728;99.000000%=618496;99.500000%=634880;99.900000%=667648;99.950000%=675840;99.990000%=692224;0%=0;0%=0;0%=0;2402;732504;509711.366536;49680.700779;0;0;0.000000%;0.000000;0.000000;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.171831%;1.344146%;725195;0;46;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;120.0%;0.00%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;0.01%;0.01%;0.02%;0.05%;45.40%;54.69%;0.00%;0.00%;0.00%
3;fio-2.16;threaded-rw;8;0;4601084;15336;3830;300010;2;147034;4145.877368;4719.323887;6;562258;265315.976424;48325.806813;1.000000%=166912;5.000000%=193536;10.000000%=207872;20.000000%=224256;30.000000%=238592;40.000000%=250880;50.000000%=261120;60.000000%=272384;70.000000%=288768;80.000000%=305152;90.000000%=329728;95.000000%=350208;99.000000%=395264;99.500000%=415744;99.900000%=460800;99.950000%=477184;99.990000%=505856;0%=0;0%=0;0%=0;3028;572535;269476.012444;48651.297561;0;0;0.000000%;0.000000;0.000000;4592656;15308;3823;300010;2;447;8.329878;3.404037;3031;562269;265358.194346;48382.236313;1.000000%=166912;5.000000%=193536;10.000000%=207872;20.000000%=224256;30.000000%=238592;40.000000%=250880;50.000000%=261120;60.000000%=272384;70.000000%=288768;80.000000%=305152;90.000000%=329728;95.000000%=350208;99.000000%=395264;99.500000%=415744;99.900000%=460800;99.950000%=481280;99.990000%=509952;0%=0;0%=0;0%=0;3041;562273;265366.861554;48382.238502;0;0;0.000000%;0.000000;0.000000;0.218831%;1.387570%;677659;0;65;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;120.4%;0.00%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;0.01%;0.01%;0.02%;39.57%;60.47%;0.02%;0.00%;0.00%;0.00%
3;fio-2.16;threaded-rw-pareto;9;0;8405000;27999;6996;300189;1;158808;1974.977175;3858.205730;6;2784978;145102.720829;143850.605529;1.000000%=5280;5.000000%=17792;10.000000%=30848;20.000000%=59136;30.000000%=82432;40.000000%=100864;50.000000%=118272;60.000000%=138240;70.000000%=160768;80.000000%=189440;90.000000%=230400;95.000000%=411648;99.000000%=700416;99.500000%=864256;99.900000%=1466368;99.950000%=1875968;99.990000%=2342912;0%=0;0%=0;0%=0;523;2784998;146854.316934;144070.648522;0;0;0.000000%;0.000000;0.000000;8406464;28003;6997;300189;1;231897;474.915486;9730.596911;6;2784994;145176.969259;144129.614396;1.000000%=5280;5.000000%=17792;10.000000%=31104;20.000000%=59136;30.000000%=81408;40.000000%=100864;50.000000%=118272;60.000000%=138240;70.000000%=160768;80.000000%=189440;90.000000%=230400;95.000000%=411648;99.000000%=700416;99.500000%=864256;99.900000%=1466368;99.950000%=1875968;99.990000%=2375680;0%=0;0%=0;0%=0;524;2895233;145706.055094;145968.440430;0;0;0.000000%;0.000000;0.000000;0.279590%;1.279566%;524581;0;94;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;111.6%;0.00%;0.00%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.53%;0.02%;0.01%;0.23%;1.55%;3.50%;10.93%;22.81%;52.70%;4.46%;2.51%;0.57%;0.20%;0.03%
3;fio-2.16;threaded-80-20;10;0;4245316;14150;3532;300013;2;124396;4504.124334;4791.120916;5;808519;459622.734825;60616.300703;1.000000%=333824;5.000000%=370688;10.000000%=387072;20.000000%=411648;30.000000%=428032;40.000000%=440320;50.000000%=456704;60.000000%=468992;70.000000%=485376;80.000000%=505856;90.000000%=536576;95.000000%=569344;99.000000%=626688;99.500000%=651264;99.900000%=700416;99.950000%=716800;99.990000%=757760;0%=0;0%=0;0%=0;4014;821965;464143.353120;60913.445240;0;0;0.000000%;0.000000;0.000000;1063868;3546;885;300013;3;2589;10.247960;5.671667;4900;817535;459629.710652;60720.930822;1.000000%=333824;5.000000%=370688;10.000000%=387072;20.000000%=411648;30.000000%=428032;40.000000%=440320;50.000000%=456704;60.000000%=468992;70.000000%=485376;80.000000%=505856;90.000000%=536576;95.000000%=569344;99.000000%=626688;99.500000%=651264;99.900000%=700416;99.950000%=716800;99.990000%=757760;0%=0;0%=0;0%=0;4905;817547;459640.335733;60721.002124;0;0;0.000000%;0.000000;0.000000;0.169581%;1.234568%;668211;0;68;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;120.4%;0.00%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;0.01%;0.02%;0.05%;77.40%;22.65%;0.02%;0.00%;0.00%
3;fio-2.16;streaming-write;11;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;77383600;257768;64435;300206;1;231200;127.096509;3963.754794;6;231768;31531.890650;55657.744024;1.000000%=358;5.000000%=362;10.000000%=366;20.000000%=370;30.000000%=382;40.000000%=410;50.000000%=426;60.000000%=446;70.000000%=506;80.000000%=102912;90.000000%=107008;95.000000%=130560;99.000000%=203776;99.500000%=203776;99.900000%=203776;99.950000%=207872;99.990000%=216064;0%=0;0%=0;0%=0;350;231771;31778.920921;55807.768576;0;0;0.000000%;0.000000;0.000000;0.364130%;1.040075%;67091;0;45;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;231.2%;0.00%;0.00%;0.01%;0.01%;0.00%;0.00%;0.00%;69.52%;4.36%;0.14%;0.02%;0.01%;0.01%;0.01%;0.00%;4.90%;21.07%;0.00%;0.00%;0.00%;0.00%;0.00%
3;fio-2.16;streaming-read;12;0;347485856;1158216;289547;300018;1;625817;39.238583;1106.812206;4;271448;7018.340079;11319.934088;1.000000%=516;5.000000%=596;10.000000%=652;20.000000%=748;30.000000%=1816;40.000000%=2992;50.000000%=4576;60.000000%=6368;70.000000%=7904;80.000000%=9408;90.000000%=13120;95.000000%=19072;99.000000%=58624;99.500000%=81408;99.900000%=128512;99.950000%=150528;99.990000%=197632;0%=0;0%=0;0%=0;286;271453;7071.688686;11356.797913;0;0;0.000000%;0.000000;0.000000;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;2.979283%;7.692487%;992266;0;34;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;160.4%;0.00%;0.00%;0.01%;0.00%;0.01%;0.00%;0.00%;0.92%;19.08%;3.70%;7.78%;15.47%;35.58%;12.77%;3.37%;1.05%;0.29%;0.01%;0.00%;0.00%;0.00%;0.00%
3;fio-2.16;streaming-rw;13;0;340537788;1135061;283759;300017;1;474006;50.289906;1134.846961;6;421486;6449.100682;12027.505625;1.000000%=422;5.000000%=596;10.000000%=612;20.000000%=652;30.000000%=916;40.000000%=1816;50.000000%=2896;60.000000%=4704;70.000000%=7008;80.000000%=9152;90.000000%=13888;95.000000%=21376;99.000000%=52480;99.500000%=76288;99.900000%=146432;99.950000%=189440;99.990000%=250880;0%=0;0%=0;0%=0;319;421488;6502.832167;12081.690006;0;0;0.000000%;0.000000;0.000000;37854524;126174;31542;300017;1;35105;4.199344;35.587682;317;421479;6428.977601;12009.156085;1.000000%=418;5.000000%=596;10.000000%=612;20.000000%=644;30.000000%=868;40.000000%=1800;50.000000%=2896;60.000000%=4704;70.000000%=7008;80.000000%=9152;90.000000%=13888;95.000000%=21376;99.000000%=52480;99.500000%=75264;99.900000%=146432;99.950000%=187392;99.990000%=261120;0%=0;0%=0;0%=0;320;421482;6433.505968;12009.196492;0;0;0.000000%;0.000000;0.000000;3.332644%;7.808336%;888036;0;52;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;127.2%;0.00%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;1.46%;26.44%;3.66%;10.13%;15.16%;26.34%;11.25%;4.48%;0.79%;0.28%;0.01%;0.00%;0.00%;0.00%;0.00%

seq-write: (groupid=0, jobs=1): err= 0: pid=27909: Tue Jul 11 20:14:18 2017
  write: io=79308MB, bw=270703KB/s, iops=65, runt=300002msec
    slat (msec): min=1, max=113, avg=14.46, stdev= 9.11
    clat (usec): min=7, max=2411.8K, avg=1927545.81, stdev=255849.49
     lat (msec): min=2, max=2428, avg=1942.76, stdev=257.23
    clat percentiles (msec):
     |  1.00th=[ 1188],  5.00th=[ 1582], 10.00th=[ 1778], 20.00th=[ 1795],
     | 30.00th=[ 1795], 40.00th=[ 1844], 50.00th=[ 1893], 60.00th=[ 1942],
     | 70.00th=[ 2040], 80.00th=[ 2147], 90.00th=[ 2278], 95.00th=[ 2376],
     | 99.00th=[ 2409], 99.50th=[ 2409], 99.90th=[ 2409], 99.95th=[ 2409],
     | 99.99th=[ 2409]
    lat (usec) : 10=0.01%
    lat (msec) : 4=0.01%, 50=0.01%, 100=0.02%, 250=0.05%, 500=0.08%
    lat (msec) : 750=0.09%, 1000=0.09%, 2000=66.20%, >=2000=34.10%
  cpu          : usr=1.89%, sys=19.05%, ctx=24202, majf=0, minf=4
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=125.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=19700/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
seq-read: (groupid=1, jobs=1): err= 0: pid=28514: Tue Jul 11 20:14:18 2017
  read : io=76164MB, bw=259958KB/s, iops=63, runt=300017msec
    slat (msec): min=10, max=150, avg=15.80, stdev= 4.13
    clat (usec): min=13, max=2319.6K, avg=2007725.50, stdev=111914.18
     lat (msec): min=21, max=2341, avg=2023.57, stdev=112.03
    clat percentiles (msec):
     |  1.00th=[ 1860],  5.00th=[ 1926], 10.00th=[ 1942], 20.00th=[ 1958],
     | 30.00th=[ 1991], 40.00th=[ 1991], 50.00th=[ 2008], 60.00th=[ 2024],
     | 70.00th=[ 2040], 80.00th=[ 2057], 90.00th=[ 2089], 95.00th=[ 2114],
     | 99.00th=[ 2180], 99.50th=[ 2212], 99.90th=[ 2311], 99.95th=[ 2311],
     | 99.99th=[ 2311]
    lat (usec) : 20=0.01%
    lat (msec) : 50=0.01%, 100=0.02%, 250=0.04%, 500=0.07%, 750=0.09%
    lat (msec) : 1000=0.08%, 2000=42.44%, >=2000=57.90%
  cpu          : usr=0.13%, sys=70.89%, ctx=106766, majf=0, minf=3
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=120.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=18914/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
seq-rw: (groupid=2, jobs=1): err= 0: pid=29043: Tue Jul 11 20:14:18 2017
  read : io=21648MB, bw=73710KB/s, iops=17, runt=300740msec
    slat (usec): min=863, max=1421.8K, avg=32282.83, stdev=95471.38
    clat (msec): min=210, max=39504, avg=3668.25, stdev=5699.16
     lat (msec): min=212, max=39505, avg=3708.08, stdev=5727.28
    clat percentiles (msec):
     |  1.00th=[  217],  5.00th=[  225], 10.00th=[  255], 20.00th=[  396],
     | 30.00th=[  947], 40.00th=[ 1106], 50.00th=[ 1713], 60.00th=[ 2573],
     | 70.00th=[ 3228], 80.00th=[ 4621], 90.00th=[ 8291], 95.00th=[16712],
     | 99.00th=[16712], 99.50th=[16712], 99.90th=[16712], 99.95th=[16712],
     | 99.99th=[16712]
  write: io=22144MB, bw=75399KB/s, iops=18, runt=300740msec
    slat (msec): min=1, max=1065, avg=13.30, stdev=72.90
    clat (usec): min=13, max=39374K, avg=3565876.45, stdev=5627879.23
     lat (msec): min=212, max=39504, avg=3583.98, stdev=5663.51
    clat percentiles (msec):
     |  1.00th=[  217],  5.00th=[  225], 10.00th=[  253], 20.00th=[  375],
     | 30.00th=[  930], 40.00th=[ 1106], 50.00th=[ 1614], 60.00th=[ 2507],
     | 70.00th=[ 3163], 80.00th=[ 4555], 90.00th=[ 7635], 95.00th=[16712],
     | 99.00th=[16712], 99.50th=[16712], 99.90th=[16712], 99.95th=[16712],
     | 99.99th=[16712]
    lat (usec) : 20=0.01%
    lat (msec) : 250=9.32%, 500=14.15%, 750=3.02%, 1000=5.69%, 2000=21.05%
    lat (msec) : >=2000=47.93%
  cpu          : usr=0.47%, sys=17.43%, ctx=27743, majf=0, minf=5
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.3%, >=64=145.8%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=5349/w=5472/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
rand-write: (groupid=3, jobs=1): err= 0: pid=30100: Tue Jul 11 20:14:18 2017
  write: io=1548.1MB, bw=5286.7KB/s, iops=1321, runt=300018msec
    slat (usec): min=1, max=263686, avg=189.40, stdev=2632.08
    clat (usec): min=7, max=415870, avg=96167.93, stdev=48331.20
     lat (usec): min=686, max=415876, avg=96923.60, stdev=48533.86
    clat percentiles (msec):
     |  1.00th=[   61],  5.00th=[   61], 10.00th=[   73], 20.00th=[   81],
     | 30.00th=[   81], 40.00th=[   84], 50.00th=[   96], 60.00th=[   96],
     | 70.00th=[   96], 80.00th=[   96], 90.00th=[   96], 95.00th=[  128],
     | 99.00th=[  383], 99.50th=[  400], 99.90th=[  400], 99.95th=[  400],
     | 99.99th=[  400]
    lat (usec) : 10=0.01%, 750=0.23%, 1000=0.01%
    lat (msec) : 20=0.01%, 50=0.10%, 100=91.21%, 250=5.77%, 500=2.71%
  cpu          : usr=0.21%, sys=0.76%, ctx=11862, majf=0, minf=4
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=475.4%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=396391/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
rand-read: (groupid=4, jobs=1): err= 0: pid=31170: Tue Jul 11 20:14:18 2017
  read : io=430096KB, bw=1433.7KB/s, iops=357, runt=300003msec
    slat (usec): min=3, max=111457, avg=2796.06, stdev=2775.37
    clat (usec): min=7, max=619901, avg=354526.00, stdev=33727.47
     lat (msec): min=2, max=622, avg=357.31, stdev=33.86
    clat percentiles (msec):
     |  1.00th=[  285],  5.00th=[  302], 10.00th=[  314], 20.00th=[  326],
     | 30.00th=[  338], 40.00th=[  347], 50.00th=[  355], 60.00th=[  363],
     | 70.00th=[  371], 80.00th=[  383], 90.00th=[  396], 95.00th=[  408],
     | 99.00th=[  433], 99.50th=[  449], 99.90th=[  578], 99.95th=[  594],
     | 99.99th=[  611]
    lat (usec) : 10=0.01%
    lat (msec) : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.02%
    lat (msec) : 250=0.08%, 500=99.87%, 750=0.13%
  cpu          : usr=0.22%, sys=1.90%, ctx=62799, majf=0, minf=3
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=119.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=107397/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
rand-rw: (groupid=5, jobs=1): err= 0: pid=31667: Tue Jul 11 20:14:18 2017
  read : io=398508KB, bw=1328.4KB/s, iops=331, runt=300003msec
    slat (usec): min=2, max=277221, avg=2978.02, stdev=3729.84
    clat (usec): min=7, max=752961, avg=191570.88, stdev=46817.42
     lat (msec): min=4, max=758, avg=194.57, stdev=47.23
    clat percentiles (msec):
     |  1.00th=[  118],  5.00th=[  137], 10.00th=[  147], 20.00th=[  159],
     | 30.00th=[  169], 40.00th=[  178], 50.00th=[  184], 60.00th=[  194],
     | 70.00th=[  202], 80.00th=[  217], 90.00th=[  243], 95.00th=[  273],
     | 99.00th=[  359], 99.50th=[  396], 99.90th=[  502], 99.95th=[  660],
     | 99.99th=[  742]
  write: io=397700KB, bw=1325.7KB/s, iops=331, runt=300003msec
    slat (usec): min=2, max=10062, avg= 8.31, stdev=29.29
    clat (msec): min=4, max=753, avg=191.40, stdev=46.71
     lat (msec): min=4, max=753, avg=191.40, stdev=46.71
    clat percentiles (msec):
     |  1.00th=[  118],  5.00th=[  137], 10.00th=[  145], 20.00th=[  159],
     | 30.00th=[  167], 40.00th=[  176], 50.00th=[  184], 60.00th=[  194],
     | 70.00th=[  202], 80.00th=[  217], 90.00th=[  243], 95.00th=[  273],
     | 99.00th=[  359], 99.50th=[  392], 99.90th=[  498], 99.95th=[  668],
     | 99.99th=[  742]
    lat (usec) : 10=0.01%
    lat (msec) : 10=0.01%, 20=0.01%, 50=0.01%, 100=0.14%, 250=91.52%
    lat (msec) : 500=8.30%, 750=0.09%, 1000=0.01%
  cpu          : usr=0.29%, sys=2.05%, ctx=58205, majf=0, minf=4
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=120.5%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=99564/w=99361/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
threaded-write: (groupid=6, jobs=16): err= 0: pid=32154: Tue Jul 11 20:14:18 2017
  write: io=2532.3MB, bw=8637.9KB/s, iops=2152, runt=300199msec
    slat (usec): min=2, max=299840, avg=2771.05, stdev=23234.68
    clat (usec): min=6, max=3060.3K, avg=943222.24, stdev=526634.32
     lat (msec): min=36, max=3060, avg=950.66, stdev=530.16
    clat percentiles (msec):
     |  1.00th=[   81],  5.00th=[   96], 10.00th=[  104], 20.00th=[  161],
     | 30.00th=[ 1020], 40.00th=[ 1020], 50.00th=[ 1221], 60.00th=[ 1221],
     | 70.00th=[ 1221], 80.00th=[ 1221], 90.00th=[ 1434], 95.00th=[ 1434],
     | 99.00th=[ 2245], 99.50th=[ 2442], 99.90th=[ 2638], 99.95th=[ 2671],
     | 99.99th=[ 2868]
    lat (usec) : 10=0.01%, 20=0.01%
    lat (msec) : 50=0.76%, 100=9.10%, 250=14.45%, 500=2.48%, 750=0.58%
    lat (msec) : 1000=2.24%, 2000=69.14%, >=2000=1.57%
  cpu          : usr=0.01%, sys=0.11%, ctx=26647, majf=0, minf=68
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=321.4%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=646234/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
threaded-read: (groupid=7, jobs=16): err= 0: pid=1196: Tue Jul 11 20:14:18 2017
  read : io=4712.8MB, bw=16085KB/s, iops=4014, runt=300014msec
    slat (usec): min=2, max=133467, avg=3975.40, stdev=4247.62
    clat (usec): min=6, max=723007, avg=505731.23, stdev=49496.33
     lat (msec): min=2, max=732, avg=509.71, stdev=49.68
    clat percentiles (msec):
     |  1.00th=[  396],  5.00th=[  429], 10.00th=[  445], 20.00th=[  465],
     | 30.00th=[  482], 40.00th=[  494], 50.00th=[  506], 60.00th=[  519],
     | 70.00th=[  529], 80.00th=[  545], 90.00th=[  570], 95.00th=[  586],
     | 99.00th=[  619], 99.50th=[  635], 99.90th=[  668], 99.95th=[  676],
     | 99.99th=[  693]
    lat (usec) : 10=0.01%
    lat (msec) : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.02%
    lat (msec) : 250=0.05%, 500=45.40%, 750=54.69%
  cpu          : usr=0.17%, sys=1.34%, ctx=725195, majf=0, minf=46
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=120.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=1204417/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
threaded-rw: (groupid=8, jobs=16): err= 0: pid=1851: Tue Jul 11 20:14:18 2017
  read : io=4493.3MB, bw=15336KB/s, iops=3830, runt=300010msec
    slat (usec): min=2, max=147034, avg=4145.88, stdev=4719.32
    clat (usec): min=6, max=562258, avg=265315.98, stdev=48325.81
     lat (msec): min=3, max=572, avg=269.48, stdev=48.65
    clat percentiles (msec):
     |  1.00th=[  167],  5.00th=[  194], 10.00th=[  208], 20.00th=[  225],
     | 30.00th=[  239], 40.00th=[  251], 50.00th=[  262], 60.00th=[  273],
     | 70.00th=[  289], 80.00th=[  306], 90.00th=[  330], 95.00th=[  351],
     | 99.00th=[  396], 99.50th=[  416], 99.90th=[  461], 99.95th=[  478],
     | 99.99th=[  506]
  write: io=4485.2MB, bw=15308KB/s, iops=3823, runt=300010msec
    slat (usec): min=2, max=447, avg= 8.33, stdev= 3.40
    clat (msec): min=3, max=562, avg=265.36, stdev=48.38
     lat (msec): min=3, max=562, avg=265.37, stdev=48.38
    clat percentiles (msec):
     |  1.00th=[  167],  5.00th=[  194], 10.00th=[  208], 20.00th=[  225],
     | 30.00th=[  239], 40.00th=[  251], 50.00th=[  262], 60.00th=[  273],
     | 70.00th=[  289], 80.00th=[  306], 90.00th=[  330], 95.00th=[  351],
     | 99.00th=[  396], 99.50th=[  416], 99.90th=[  461], 99.95th=[  482],
     | 99.99th=[  510]
    lat (usec) : 10=0.01%
    lat (msec) : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.02%
    lat (msec) : 250=39.57%, 500=60.47%, 750=0.02%
  cpu          : usr=0.22%, sys=1.39%, ctx=677659, majf=0, minf=65
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=120.4%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=1149250/w=1147153/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
threaded-rw-pareto: (groupid=9, jobs=16): err= 0: pid=3828: Tue Jul 11 20:14:18 2017
  read : io=8208.8MB, bw=27999KB/s, iops=6996, runt=300189msec
    slat (usec): min=1, max=158808, avg=1974.98, stdev=3858.21
    clat (usec): min=6, max=2784.1K, avg=145102.72, stdev=143850.61
     lat (usec): min=523, max=2784.1K, avg=146854.32, stdev=144070.65
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[   18], 10.00th=[   31], 20.00th=[   60],
     | 30.00th=[   83], 40.00th=[  101], 50.00th=[  119], 60.00th=[  139],
     | 70.00th=[  161], 80.00th=[  190], 90.00th=[  231], 95.00th=[  412],
     | 99.00th=[  701], 99.50th=[  865], 99.90th=[ 1467], 99.95th=[ 1876],
     | 99.99th=[ 2343]
  write: io=8209.5MB, bw=28004KB/s, iops=6997, runt=300189msec
    slat (usec): min=1, max=231897, avg=474.92, stdev=9730.60
    clat (usec): min=6, max=2784.1K, avg=145176.97, stdev=144129.61
     lat (usec): min=524, max=2895.3K, avg=145706.06, stdev=145968.44
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[   18], 10.00th=[   32], 20.00th=[   60],
     | 30.00th=[   82], 40.00th=[  101], 50.00th=[  119], 60.00th=[  139],
     | 70.00th=[  161], 80.00th=[  190], 90.00th=[  231], 95.00th=[  412],
     | 99.00th=[  701], 99.50th=[  865], 99.90th=[ 1467], 99.95th=[ 1876],
     | 99.99th=[ 2376]
    lat (usec) : 10=0.01%, 20=0.01%, 750=0.53%, 1000=0.02%
    lat (msec) : 2=0.01%, 4=0.23%, 10=1.55%, 20=3.50%, 50=10.93%
    lat (msec) : 100=22.81%, 250=52.70%, 500=4.46%, 750=2.51%, 1000=0.57%
    lat (msec) : 2000=0.20%, >=2000=0.03%
  cpu          : usr=0.28%, sys=1.28%, ctx=524581, majf=0, minf=94
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=111.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=2100241/w=2100593/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
threaded-80-20: (groupid=10, jobs=16): err= 0: pid=5632: Tue Jul 11 20:14:18 2017
  read : io=4145.9MB, bw=14150KB/s, iops=3532, runt=300013msec
    slat (usec): min=2, max=124396, avg=4504.12, stdev=4791.12
    clat (usec): min=5, max=808519, avg=459622.73, stdev=60616.30
     lat (msec): min=4, max=821, avg=464.14, stdev=60.91
    clat percentiles (msec):
     |  1.00th=[  334],  5.00th=[  371], 10.00th=[  388], 20.00th=[  412],
     | 30.00th=[  429], 40.00th=[  441], 50.00th=[  457], 60.00th=[  469],
     | 70.00th=[  486], 80.00th=[  506], 90.00th=[  537], 95.00th=[  570],
     | 99.00th=[  627], 99.50th=[  652], 99.90th=[  701], 99.95th=[  717],
     | 99.99th=[  758]
  write: io=1038.1MB, bw=3546.8KB/s, iops=885, runt=300013msec
    slat (usec): min=3, max=2589, avg=10.25, stdev= 5.67
    clat (msec): min=4, max=817, avg=459.63, stdev=60.72
     lat (msec): min=4, max=817, avg=459.64, stdev=60.72
    clat percentiles (msec):
     |  1.00th=[  334],  5.00th=[  371], 10.00th=[  388], 20.00th=[  412],
     | 30.00th=[  429], 40.00th=[  441], 50.00th=[  457], 60.00th=[  469],
     | 70.00th=[  486], 80.00th=[  506], 90.00th=[  537], 95.00th=[  570],
     | 99.00th=[  627], 99.50th=[  652], 99.90th=[  701], 99.95th=[  717],
     | 99.99th=[  758]
    lat (usec) : 10=0.01%
    lat (msec) : 10=0.01%, 20=0.01%, 50=0.01%, 100=0.02%, 250=0.05%
    lat (msec) : 500=77.40%, 750=22.65%, 1000=0.02%
  cpu          : usr=0.17%, sys=1.23%, ctx=668211, majf=0, minf=68
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=120.4%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=1059678/w=265586/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
streaming-write: (groupid=11, jobs=16): err= 0: pid=6600: Tue Jul 11 20:14:18 2017
  write: io=75570MB, bw=257768KB/s, iops=64435, runt=300206msec
    slat (usec): min=1, max=231200, avg=127.10, stdev=3963.75
    clat (usec): min=6, max=231768, avg=31531.89, stdev=55657.74
     lat (usec): min=350, max=231771, avg=31778.92, stdev=55807.77
    clat percentiles (usec):
     |  1.00th=[  358],  5.00th=[  362], 10.00th=[  366], 20.00th=[  370],
     | 30.00th=[  382], 40.00th=[  410], 50.00th=[  426], 60.00th=[  446],
     | 70.00th=[  506], 80.00th=[102912], 90.00th=[107008], 95.00th=[130560],
     | 99.00th=[203776], 99.50th=[203776], 99.90th=[203776], 99.95th=[207872],
     | 99.99th=[216064]
    lat (usec) : 10=0.01%, 20=0.01%, 500=69.52%, 750=4.36%, 1000=0.14%
    lat (msec) : 2=0.02%, 4=0.01%, 10=0.01%, 20=0.01%, 100=4.90%
    lat (msec) : 250=21.07%
  cpu          : usr=0.36%, sys=1.04%, ctx=67091, majf=0, minf=45
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=231.2%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=19343868/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
streaming-read: (groupid=12, jobs=16): err= 0: pid=7713: Tue Jul 11 20:14:18 2017
  read : io=339342MB, bw=1131.8MB/s, iops=289547, runt=300018msec
    slat (usec): min=1, max=625817, avg=39.24, stdev=1106.81
    clat (usec): min=4, max=271448, avg=7018.34, stdev=11319.93
     lat (usec): min=286, max=271453, avg=7071.69, stdev=11356.80
    clat percentiles (usec):
     |  1.00th=[  516],  5.00th=[  596], 10.00th=[  652], 20.00th=[  748],
     | 30.00th=[ 1816], 40.00th=[ 2992], 50.00th=[ 4576], 60.00th=[ 6368],
     | 70.00th=[ 7904], 80.00th=[ 9408], 90.00th=[13120], 95.00th=[19072],
     | 99.00th=[58624], 99.50th=[81408], 99.90th=[128512], 99.95th=[150528],
     | 99.99th=[197632]
    lat (usec) : 10=0.01%, 50=0.01%, 500=0.92%, 750=19.08%, 1000=3.70%
    lat (msec) : 2=7.78%, 4=15.47%, 10=35.58%, 20=12.77%, 50=3.37%
    lat (msec) : 100=1.05%, 250=0.29%, 500=0.01%
  cpu          : usr=2.98%, sys=7.69%, ctx=992266, majf=0, minf=34
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=160.4%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=86869432/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
streaming-rw: (groupid=13, jobs=16): err= 0: pid=8243: Tue Jul 11 20:14:18 2017
  read : io=332556MB, bw=1108.5MB/s, iops=283759, runt=300017msec
    slat (usec): min=1, max=474006, avg=50.29, stdev=1134.85
    clat (usec): min=6, max=421486, avg=6449.10, stdev=12027.51
     lat (usec): min=319, max=421488, avg=6502.83, stdev=12081.69
    clat percentiles (usec):
     |  1.00th=[  422],  5.00th=[  596], 10.00th=[  612], 20.00th=[  652],
     | 30.00th=[  916], 40.00th=[ 1816], 50.00th=[ 2896], 60.00th=[ 4704],
     | 70.00th=[ 7008], 80.00th=[ 9152], 90.00th=[13888], 95.00th=[21376],
     | 99.00th=[52480], 99.50th=[76288], 99.90th=[146432], 99.95th=[189440],
     | 99.99th=[250880]
  write: io=36967MB, bw=126175KB/s, iops=31542, runt=300017msec
    slat (usec): min=1, max=35105, avg= 4.20, stdev=35.59
    clat (usec): min=317, max=421479, avg=6428.98, stdev=12009.16
     lat (usec): min=320, max=421482, avg=6433.51, stdev=12009.20
    clat percentiles (usec):
     |  1.00th=[  418],  5.00th=[  596], 10.00th=[  612], 20.00th=[  644],
     | 30.00th=[  868], 40.00th=[ 1800], 50.00th=[ 2896], 60.00th=[ 4704],
     | 70.00th=[ 7008], 80.00th=[ 9152], 90.00th=[13888], 95.00th=[21376],
     | 99.00th=[52480], 99.50th=[75264], 99.90th=[146432], 99.95th=[187392],
     | 99.99th=[261120]
    lat (usec) : 10=0.01%, 500=1.46%, 750=26.44%, 1000=3.66%
    lat (msec) : 2=10.13%, 4=15.16%, 10=26.34%, 20=11.25%, 50=4.48%
    lat (msec) : 100=0.79%, 250=0.28%, 500=0.01%
  cpu          : usr=3.33%, sys=7.81%, ctx=888036, majf=0, minf=52
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=127.2%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=85132624/w=9463422/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: io=79308MB, aggrb=270702KB/s, minb=270702KB/s, maxb=270702KB/s, mint=300002msec, maxt=300002msec

Run status group 1 (all jobs):
   READ: io=76164MB, aggrb=259958KB/s, minb=259958KB/s, maxb=259958KB/s, mint=300017msec, maxt=300017msec

Run status group 2 (all jobs):
   READ: io=21648MB, aggrb=73710KB/s, minb=73710KB/s, maxb=73710KB/s, mint=300740msec, maxt=300740msec
  WRITE: io=22144MB, aggrb=75398KB/s, minb=75398KB/s, maxb=75398KB/s, mint=300740msec, maxt=300740msec

Run status group 3 (all jobs):
  WRITE: io=1548.1MB, aggrb=5286KB/s, minb=5286KB/s, maxb=5286KB/s, mint=300018msec, maxt=300018msec

Run status group 4 (all jobs):
   READ: io=430096KB, aggrb=1433KB/s, minb=1433KB/s, maxb=1433KB/s, mint=300003msec, maxt=300003msec

Run status group 5 (all jobs):
   READ: io=398508KB, aggrb=1328KB/s, minb=1328KB/s, maxb=1328KB/s, mint=300003msec, maxt=300003msec
  WRITE: io=397700KB, aggrb=1325KB/s, minb=1325KB/s, maxb=1325KB/s, mint=300003msec, maxt=300003msec

Run status group 6 (all jobs):
  WRITE: io=2532.3MB, aggrb=8637KB/s, minb=8637KB/s, maxb=8637KB/s, mint=300199msec, maxt=300199msec

Run status group 7 (all jobs):
   READ: io=4712.8MB, aggrb=16085KB/s, minb=16085KB/s, maxb=16085KB/s, mint=300014msec, maxt=300014msec

Run status group 8 (all jobs):
   READ: io=4493.3MB, aggrb=15336KB/s, minb=15336KB/s, maxb=15336KB/s, mint=300010msec, maxt=300010msec
  WRITE: io=4485.2MB, aggrb=15308KB/s, minb=15308KB/s, maxb=15308KB/s, mint=300010msec, maxt=300010msec

Run status group 9 (all jobs):
   READ: io=8208.8MB, aggrb=27999KB/s, minb=27999KB/s, maxb=27999KB/s, mint=300189msec, maxt=300189msec
  WRITE: io=8209.5MB, aggrb=28003KB/s, minb=28003KB/s, maxb=28003KB/s, mint=300189msec, maxt=300189msec

Run status group 10 (all jobs):
   READ: io=4145.9MB, aggrb=14150KB/s, minb=14150KB/s, maxb=14150KB/s, mint=300013msec, maxt=300013msec
  WRITE: io=1038.1MB, aggrb=3546KB/s, minb=3546KB/s, maxb=3546KB/s, mint=300013msec, maxt=300013msec

Run status group 11 (all jobs):
  WRITE: io=75570MB, aggrb=257768KB/s, minb=257768KB/s, maxb=257768KB/s, mint=300206msec, maxt=300206msec

Run status group 12 (all jobs):
   READ: io=339342MB, aggrb=1131.8MB/s, minb=1131.8MB/s, maxb=1131.8MB/s, mint=300018msec, maxt=300018msec

Run status group 13 (all jobs):
   READ: io=332556MB, aggrb=1108.5MB/s, minb=1108.5MB/s, maxb=1108.5MB/s, mint=300017msec, maxt=300017msec
  WRITE: io=36967MB, aggrb=126174KB/s, minb=126174KB/s, maxb=126174KB/s, mint=300017msec, maxt=300017msec